nc: 80
depth_multiple: 1.0
width_multiple: 1.0
anchors: 4
  # - [10,13, 16,30, 33,23]  # P3/8
  # - [30,61, 62,45, 59,119]  # P4/16
  # - [116,90, 156,198, 373,326]  # P5/32

backbone:
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]], # 2
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3, [256]], # 4
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]], # 6
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, SPP, [1024, [5, 9, 13]]], # 8
   [-1, 3, C3STR, [1024, False]],  # 9
  ]

# head
head:
  [[-1, 1, Conv, [512, 1, 1]], # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 11
   [[-1, 6], 1, Concat, [1]],  # 12, cat backbone P4
   [-1, 3, C3, [512, False]],  # 13
   [-1, 1, CBAM, [512]], # 14

   [-1, 1, Conv, [256, 1, 1]], # 15
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 16
   [[-1, 4], 1, Concat, [1]],  # 17, cat backbone P3
   [-1, 3, C3, [256, False]],  # 18 (P3/8-small)
   [-1, 1, CBAM, [256]], # 19

   [ -1, 1, Conv, [ 128, 1, 1 ] ], # 20
   [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ], # 21
   [[ -1, 2], 1, Concat, [ 1 ] ],  # 22, cat backbone P2
   [ -1, 1, C3STR, [ 128, False ] ],  # 23 (P2/4-xsmall)
   [-1, 1, CBAM, [128]], # 24

   [ -1, 1, Conv, [ 128, 3, 2 ] ], # 25
   [ [ -1, 20, 4], 1, Concat, [ 1 ] ], # 26, cat head P3
   [ -1, 1, C3STR, [ 256, False ] ],  # 27 (P3/8-small)
   [-1, 1, CBAM, [256]], # 28

   [-1, 1, Conv, [256, 3, 2]], # 29
   [[-1, 15, 6], 1, Concat, [1]], # 30, cat head P4
   [-1, 2, C3STR, [512, False]],  # 31 (P4/16-medium)
   [-1, 1, CBAM, [512]], # 32

   [-1, 1, Conv, [512, 3, 2]], # 33
   [[-1, 10], 1, Concat, [1]],  # 34, cat head P5
   [-1, 3, C3STR, [1024, False]], # 35 (P5/32-large)

   [[23, 27, 31, 35], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]